espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/board/src/sl_board_control_stub.c
/***************************************************************************//**
 * @file
 * @brief Board Control API
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/
#include "sl_board_control.h"

sl_status_t sl_board_configure_vcom(void)
{
  return SL_STATUS_NOT_AVAILABLE;
}

sl_status_t sl_board_enable_vcom(void)
{
  return SL_STATUS_NOT_AVAILABLE;
}

sl_status_t sl_board_disable_vcom(void)
{
  return SL_STATUS_NOT_AVAILABLE;
}

sl_status_t sl_board_enable_display(void)
{
  return SL_STATUS_NOT_AVAILABLE;
}

sl_status_t sl_board_disable_display(void)
{
  return SL_STATUS_NOT_AVAILABLE;
}

sl_status_t sl_board_enable_sensor(sl_board_sensor_t sensor)
{
  (void) sensor;
  return SL_STATUS_NOT_AVAILABLE;
}

sl_status_t sl_board_disable_sensor(sl_board_sensor_t sensor)
{
  (void) sensor;
  return SL_STATUS_NOT_AVAILABLE;
}

sl_status_t sl_board_enable_memory(sl_board_memory_t memory)
{
  (void) memory;
  return SL_STATUS_NOT_AVAILABLE;
}

sl_status_t sl_board_disable_memory(sl_board_memory_t memory)
{
  (void) memory;
  return SL_STATUS_NOT_AVAILABLE;
}

sl_status_t sl_board_enable_oscillator(sl_board_oscillator_t oscillator)
{
  (void) oscillator;
  return SL_STATUS_NOT_AVAILABLE;
}

sl_status_t sl_board_disable_oscillator(sl_board_oscillator_t oscillator)
{
  (void) oscillator;
  return SL_STATUS_NOT_AVAILABLE;
}
